{
    "careers": [
        {
            "name":"Chef",
            "description": "A chef is a trained professional cook and tradesman who is proficient in all aspects of food preparation, often focusing on a particular cuisine. The word \"chef\" is derived from the term chef de cuisine (French pronunciation: [ʃɛf.də.kɥi.zin]), the director or head of a kitchen. Chefs can receive formal training from an institution, as well as by apprenticing with an experienced chef.\nThere are different terms that use the word chef in their titles, and deal with specific areas of food preparation, such as the sous-chef, who acts as the second-in-command in a kitchen, or the chef de partie, who handles a specific area of production, or “Television chef”, such as Alison Holst. The kitchen brigade system is a hierarchy found in restaurants and hotels employing extensive staff, many of which use the word \"chef\" in their titles. Underneath the chefs are the kitchen assistants. A chef's standard uniform includes a hat (called a toque), neckerchief, double-breasted jacket, apron and sturdy shoes (that may include steel or plastic toe-caps).",
            "salary": 43180,
            "degree": 3,
            "personality": 12,
            "futureDemand": 1
        },
        {
            "name":"Systems administrator",
            "description": "A system administrator, or sysadmin, is a person who is responsible for the upkeep, configuration, and reliable operation of computer systems; especially multi-user computers, such as servers. The system administrator seeks to ensure that the uptime, performance, resources, and security of the computers they manage meet the needs of the users, without exceeding a set budget when doing so.\nTo meet these needs, a system administrator may acquire, install, or upgrade computer components and software; provide routine automation; maintain security policies; troubleshoot; train or supervise staff; or offer technical support for projects.",
            "salary": 84224,
            "degree": 2,
            "personality": 0,
            "futureDemand": 1
        },
        {
            "name":"Human resource",
            "description": "Human resources are the people who make up the workforce of an organization, business sector, or economy. \"Human capital\" is sometimes used synonymously with \"human resources\", although human capital typically refers to a narrower effect (i.e., the knowledge the individuals embody and economic growth). Likewise, other terms sometimes used include manpower, talent, labour, personnel, or simply people.\nA human-resources department (HR department) of an organization performs human resource management, overseeing various aspects of employment, such as compliance with labor law and employment standards, administration of employee benefits, organizing of employees files with the required documents for future reference, some aspects of recruitment.",
            "salary": 60880,
            "degree": 2,
            "personality": 13,
            "futureDemand": 1
        },
        {
            "name":"Kindergarten teacher",
            "description": "",
            "salary": 55470,
            "degree": 2,
            "personality": 1,
            "futureDemand": 1
        },
        {
            "name":"Military officer",
            "description": "An officer is a member of an armed forces or uniformed service who holds a position of authority.\nIn its broadest sense, the term \"officer\" refers to commissioned officers, non-commissioned officers, and warrant officers. However, when used without further detail, the term almost always refers to only commissioned officers, the more senior portion of a force who derive their authority from a commission from the head of state.",
            "salary": 38250,
            "degree": 2,
            "personality": 8,
            "futureDemand": 1
        },
        {
            "name":"Police officer",
            "description": "A police officer, also known as an officer, policeman, or a policewoman is a warranted law employee of a police force. In most countries, \"police officer\" is a generic term not specifying a particular rank. In some, the use of the rank \"officer\" is legally reserved for military personnel.\nPolice officers are generally charged with the apprehension of criminals and the prevention and detection of crime, protection and assistance of the general public, and the maintenance of public order. Police officers may be sworn to an oath, and have the power to arrest people and detain them for a limited time, along with other duties and powers. Some officers are trained in special duties, such as counter-terrorism, surveillance, child protection, VIP protection, civil law enforcement, and investigation techniques into major crime including fraud, rape, murder, and drug trafficking. Although many police officers wear a corresponding uniform, some police officers are plain-clothed in order to pass themselves off as civilians. In most countries police officers are given exemptions from certain laws to perform their duties. For example an officer may use force if necessary to arrest or detain a person when it would ordinarily be assault. Officers can also break road rules to perform their duties.",
            "salary": 65400,
            "degree": 3,
            "personality": 4,
            "futureDemand": 1
        },
        {
            "name":"Flight attendant",
            "description": "Flight attendant or (also known as steward/stewardess or air host/air hostess) is a member of an aircrew employed by airlines aboard commercial flights, primarily to ensure the safety and comfort of passengers. Collectively called the cabin crew, flight attendants are deployed in the cabins of all commercial flights and additionally may also be present on some private or business jets and government or military aircraft.",
            "salary": 48500,
            "degree": 3,
            "personality": 9,
            "futureDemand": 1
        },
        {
            "name":"Occupational therapist",
            "description": "Occupational Therapists (OTs) are health care professionals who utilize evidence-based practice, research, scientific evidence, and a holistic perspective to promote independence, meaningful occupations, and patients' functional ability to fulfill their daily routines and roles. OTs ensure their patient-oriented interventions are effective. They have background training on the psychological, physical, emotional, and social makeup. OTs also have immense training in treating the whole body with the incorporation of neurological principles, anatomical or physiological concepts, and psychological perspectives. They support individuals across their lifespan to fulfill meaningful activities, known as occupations, individually by using therapeutic interventions.\nOccupational therapists work in a variety of fields, including pediatrics, orthopedics, neurology, and geriatrics. The main approach of occupational therapy is to assist individuals in regaining skills as well as in increasing their abilities and decreasing limitations or disabilities of any kind. OTs evaluate the individual as well as their home and other immediate environments. Upon evaluating, they recommend, as needed, adaptive equipment and training in its use, guidance, and education for family members and caregivers. OTs determine a patient's individualized goals with the help of the person's family, caregiver, and doctor.\nOTs customize each intervention to improve a person's ability to perform daily life activities and to reach his or her goals. OTs perform outcomes measures to evaluate the person's abilities and to ensure there is progress toward the goals. This outcome evaluation also helps the therapist to understand if an intervention plan must be changed.",
            "salary": 83200,
            "degree": 1,
            "personality": 5,
            "futureDemand": 1
        },
        {
            "name":"Project manager",
            "description": "A project manager is a professional in the field of project management. Project managers have the responsibility of the planning, procurement and execution of a project, in any undertaking that has a defined scope, defined start and a defined finish; regardless of industry. Project managers are first point of contact for any issues or discrepancies arising from within the heads of various departments in an organization before the problem escalates to higher authorities.\nProject management is the responsibility of a project manager. This individual seldom participates directly in the activities that produce the end result, but rather strives to maintain the progress, mutual interaction and tasks of various parties in such a way that reduces the risk of overall failure, maximizes benefits, and minimizes costs.",
            "salary": 54824,
            "degree": 2,
            "personality": 15,
            "futureDemand": 1
        },
        {
            "name":"Microbiologist",
            "description": "A microbiologist (from Greek μῑκρος) is a scientist who studies microscopic life forms and processes. This includes study of the growth, interactions and characteristics of microscopic organisms such as bacteria, algae, fungi, and some types of parasites and their vectors. Most microbiologists work in offices and/or research facilities, both in private biotechnology companies as well as in academia. Most microbiologists specialize in a given topic within microbiology such as bacteriology, parasitology, virology, or immunology.",
            "salary": 71650,
            "degree": 2,
            "personality": 3,
            "futureDemand": 1
        },
        {
            "name":"Social worker",
            "description": "Social work is an academic discipline and profession that concerns itself with individuals, families, groups and communities in an effort to enhance social functioning and overall well-being. Social functioning is the way in which people perform their social roles, and the structural institutions that are provided[by whom?] to sustain them. Social work applies social sciences, such as sociology, psychology, political science, public health, community development, law, and economics, to engage with client systems, conduct assessments, and develop interventions to solve social and personal problems; and to bring about social change. Social work practice is often divided into micro-work, which involves working directly with individuals or small groups; and macro-work, which involves working with communities, and - within social policy - fostering change on a larger scale.\nThe social work industry developed in the 19th century, with some of its roots in voluntary philanthropy and in grassroots organizing. However, responses to social needs had existed long before then, primarily from private charities and from religious organizations. The effects of the Industrial Revolution and of the Great Depression of the 1930s placed pressure on social work to become a more defined discipline.",
            "salary": 49470,
            "degree": 2,
            "personality": 14,
            "futureDemand": 1
        },
        {
            "name":"Veterinarian",
            "description": "A veterinarian (vet), also known as a veterinary surgeon or veterinary physician, is a professional who practices veterinary medicine by treating diseases, disorders, and injuries in non-human animals.\nIn many countries, the local nomenclature for a veterinarian is a regulated and protected term, meaning that members of the public without the prerequisite qualifications and/or licensure are not able to use the title. In many cases, the activities that may be undertaken by a veterinarian (such as treatment of illness or surgery in animals) are restricted only to those professionals who are registered as a veterinarian. For instance, in the United Kingdom, as in other jurisdictions, animal treatment may only be performed by registered veterinary physicians (with a few designated exceptions, such as paraveterinary workers), and it is illegal for any person who is not registered to call themselves a veterinarian, prescribe any drugs, or perform treatment.\nMost veterinary physicians work in clinical settings, treating animals directly. These veterinarians may be involved in a general practice, treating animals of all types; they may be specialized in a specific group of animals such as companion animals, livestock, zoo animals or equines; or may specialize in a narrow medical discipline such as surgery, dermatology or internal medicine . As with other healthcare professionals, veterinarians face ethical decisions about the care of their patients. Current debates within the profession include the ethics of certain procedures believed to be purely cosmetic or unnecessary for behavioral issues, such as declawing of cats, docking of tails, cropping of ears and debarking on dogs.",
            "salary": 90420,
            "degree": 4,
            "personality": 2,
            "futureDemand": 1
        },
        {
            "name":"Reporter",
            "description": "A journalist is a person who collects, writes, or distributes news or other current information to the public. A journalist's work is called journalism. A journalist can work with general issues or specialize in certain issues. However, most journalists tend to specialize, and by cooperating with other journalists, produce journals that span many topics. For example, a sports journalist covers news within the world of sports, but this journalist may be a part of a newspaper that covers many different topics.\nA reporter is a type of journalist who researches, writes, and reports on information in order to present in sources, conduct interviews, engage in research, and make reports. The information-gathering part of a journalist's job is sometimes called reporting, in contrast to the production part of the job such as writing articles. Reporters may split their time between working in a newsroom and going out to witness events or interviewing people. Reporters may be assigned a specific beat or area of coverage.",
            "salary": 39370,
            "degree": 2,
            "personality": 11,
            "futureDemand": 1
        },
        {
            "name":"College professor",
            "description": "Professor (commonly abbreviated as Prof.) is an academic rank at universities and other post-secondary education and research institutions in most countries. Literally, professor derives from Latin as a 'person who professes' being usually an expert in arts or sciences, a teacher of the highest rank.\nIn most systems of academic ranks the word 'professor' only refers to the most senior academic position, sometimes informally known as 'full professor'. In some countries or institutions, the word 'professor' is also used in titles of lower ranks such as associate professor and assistant professor; this is particularly the case in the United States, where the word professor is sometimes used colloquially to refer to anyone in an academic post. This colloquial usage would be considered incorrect among most other academic communities. However, the unqualified title Professor designated with a capital letter usually refers to a full professor also in English language usage.\nProfessors often conduct original research and commonly teach undergraduate, professional or postgraduate courses in their fields of expertise. In universities with graduate schools, professors may mentor and supervise graduate students conducting research for a thesis or dissertation. In many universities, 'full professors' take on senior managerial roles, leading departments, research teams and institutes, and filling roles such as president, principal or vice-chancellor. The role of professor may be more public facing than that of more junior staff, and professors are expected to be national or international leaders in their field of expertise.",
            "salary": 67536,
            "degree": 1,
            "personality": 7,
            "futureDemand": 1
        },
        {
            "name":"Landscape architect",
            "description": "A landscape architect is a person who is educated in the field of landscape architecture. The practice of landscape architecture includes: site analysis, site inventory, land planning, planting design, grading, storm water management, sustainable design, construction specification and ensuring that all plans meet the current building codes and local and federal ordinances. The title landscape architect was first used by Frederick Law Olmsted, the designer of New York City's Central Park.",
            "salary": 68820,
            "degree": 2,
            "personality": 10,
            "futureDemand": 1
        },
        {
            "name":"Fine artist",
            "description": "Creates original artistic work in a variety of mediums, such as painting, drawing, sculpture, video, film or performance.\nFine Art is the traditional term used to embrace painting, sculpture and printmaking, produced for its own sake and not concerned with whether it is functional or practical. Recently the term has come to include photography, video and the modern technologies that generate visual imagery.\nFine artists create original artwork using a variety of mediums. Their work is best described according to their area of specialisation which can be two-dimensional (such as painting), three-dimensional (sculpture) or even four-dimensional (moving images). In addition, many artists choose to also specialise in a subject such as landscapes or portraits.\nFine artists can be hired or commissioned to produce pieces of artwork or create their own pieces to be sold at a later date.",
            "salary": 48605,
            "degree": 3,
            "personality": 6,
            "futureDemand": 1
        }
    ]
}